## Pandas 練習

## 安裝

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/pellok/anaconda3/lib/python3.6/site-packages
Requirement already satisfied: python-dateutil>=2 in /Users/pellok/anaconda3/lib/python3.6/site-packages (from pandas)
Requirement already satisfied: pytz>=2011k in /Users/pellok/anaconda3/lib/python3.6/site-packages (from pandas)
Requirement already satisfied: numpy>=1.7.0 in /Users/pellok/anaconda3/lib/python3.6/site-packages (from pandas)
Requirement already satisfied: six>=1.5 in /Users/pellok/anaconda3/lib/python3.6/site-packages (from python-dateutil>=2->pandas)

## 匯入

In [2]:
from pandas import Series, DataFrame
import pandas as pd

## Series

In [3]:
s = Series([100, "PYTHON", "Sochow","Qiwsir"])
s

0       100
1    PYTHON
2    Sochow
3    Qiwsir
dtype: object

In [4]:
s.values

array([100, 'PYTHON', 'Sochow', 'Qiwsir'], dtype=object)

In [5]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
s2 = Series([100, "PYTHON","Soochow","Qiwsir"], index=["mark","title","univeristy","name"])
s2

mark              100
title          PYTHON
univeristy    Soochow
name           Qiwsir
dtype: object

In [7]:
s2.index

Index(['mark', 'title', 'univeristy', 'name'], dtype='object')

In [8]:
s2["name"]

'Qiwsir'

In [9]:
s2["name"] = "AOI"
s2

mark              100
title          PYTHON
univeristy    Soochow
name              AOI
dtype: object

In [10]:
sd = {"python": 8080, "c++": 8081, "c#": 4000}
s4 = Series(sd)
s4

c#        4000
c++       8081
python    8080
dtype: int64

In [11]:
s6 = Series(sd, index=['java','python','c++', 'c#'])
s6

java         NaN
python    8080.0
c++       8081.0
c#        4000.0
dtype: float64

In [12]:
ilist = ["java","perl"]
s5 = Series(sd,index=ilist)
s5

java   NaN
perl   NaN
dtype: float64

In [13]:
pd.isnull(s6)

java       True
python    False
c++       False
c#        False
dtype: bool

In [14]:
pd.notnull(s6)

java      False
python     True
c++        True
c#         True
dtype: bool

In [15]:
s6.isnull()

java       True
python    False
c++       False
c#        False
dtype: bool

In [16]:
s6.index = ["p1","p2","p3","p4"]
s6

p1       NaN
p2    8080.0
p3    8081.0
p4    4000.0
dtype: float64

In [17]:
s3 = Series([3,9,4,7], index=['a','b','c','d'])
s3

a    3
b    9
c    4
d    7
dtype: int64

In [18]:
s3[s3 >5]

b    9
d    7
dtype: int64

In [19]:
s3 * 5

a    15
b    45
c    20
d    35
dtype: int64

In [20]:
s5 + s6

java   NaN
p1     NaN
p2     NaN
p3     NaN
p4     NaN
perl   NaN
dtype: float64

## DataFrame

In [21]:
data = {"name":["yahoo","google","facebook"], "mark":[200,400,800], "price":[9,3,7]}
f1 = DataFrame(data)
f1

   mark      name  price
0   200     yahoo      9
1   400    google      3
2   800  facebook      7

In [22]:
f2 = DataFrame(data, columns=["name", "price","mark"])
f2

       name  price  mark
0     yahoo      9   200
1    google      3   400
2  facebook      7   800

In [23]:
f3 = DataFrame(data, columns=['name', 'price', 'mark', 'debt'], index=['a','b','c']) 
f3

       name  price  mark debt
a     yahoo      9   200  NaN
b    google      3   400  NaN
c  facebook      7   800  NaN

In [24]:
newdata = {"lang":{"firstline":"python","secondline":"java"}, "price":{"firstline":8000}} 
f4 = DataFrame(newdata)
f4

              lang   price
firstline   python  8000.0
secondline    java     NaN

In [25]:
DataFrame(newdata, index=["firstline","secondline","thirdline"])

              lang   price
firstline   python  8000.0
secondline    java     NaN
thirdline      NaN     NaN

In [26]:
f3.columns

Index(['name', 'price', 'mark', 'debt'], dtype='object')

In [27]:
f3['name']

a       yahoo
b      google
c    facebook
Name: name, dtype: object

In [28]:
f3['debt'] = 89.2
f3

       name  price  mark  debt
a     yahoo      9   200  89.2
b    google      3   400  89.2
c  facebook      7   800  89.2

In [29]:
sdebt = Series([2.2, 3.3], index=["a","c"]) 
f3['debt'] = sdebt 
f3

       name  price  mark  debt
a     yahoo      9   200   2.2
b    google      3   400   NaN
c  facebook      7   800   3.3

In [30]:
f3["price"]["c"]= 300
f3

/Users/pellok/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

       name  price  mark  debt
a     yahoo      9   200   2.2
b    google      3   400   NaN
c  facebook    300   800   3.3